; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	thermograph0 - mode
	image1 - mode
	image2 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	Star11 - direction
	Star0 - direction
	Star5 - direction
	GroundStation2 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet15)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation10)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation10)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star9)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star11)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite0 GroundStation8)
	(have_image Planet12 thermograph0)
	(have_image Phenomenon13 image1)
	(have_image Star14 thermograph0)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Star17 image2)
	(have_image Phenomenon18 thermograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
2. (calibrate satellite1 instrument1 groundstation10)
   added: (calibrated instrument1)
   goals met: 0 of 8
3. (turn_to satellite1 phenomenon18 groundstation10)
   deleted: (pointing satellite1 groundstation10)
   added: (pointing satellite1 phenomenon18)
   goals met: 0 of 8
4. (take_image satellite1 phenomenon18 instrument1 thermograph0)
   added: (have_image phenomenon18 thermograph0)
   goals met: 1 of 8
5. (turn_to satellite1 phenomenon16 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 8
6. (take_image satellite1 phenomenon16 instrument1 image2)
   added: (have_image phenomenon16 image2)
   goals met: 2 of 8
7. (turn_to satellite1 phenomenon13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 8
8. (turn_to satellite0 groundstation8 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation8)
   goals met: 3 of 8
9. (take_image satellite1 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 4 of 8
10. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 4 of 8
11. (take_image satellite1 planet12 instrument1 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 5 of 8
12. (turn_to satellite1 planet15 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet15)
   goals met: 5 of 8
13. (take_image satellite1 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 6 of 8
14. (turn_to satellite1 star14 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star14)
   goals met: 6 of 8
15. (take_image satellite1 star14 instrument1 thermograph0)
   added: (have_image star14 thermograph0)
   goals met: 7 of 8
16. (turn_to satellite1 star17 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star17)
   goals met: 7 of 8
17. (take_image satellite1 star17 instrument1 image2)
   added: (have_image star17 image2)
   goals met: 8 of 8
